<!DOCTYPE html>
<html lang="es">
  <head>
    <meta charset="utf-8">
    <!--Agregar keywords-->
    <meta name="description" content="Años dosmil">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
      <meta name="keywords" content="Evolución web, Línea del tiempo Web, ">
    <title></title>
    <link rel="stylesheet" href="css/diseño.css">
  </head>
  <header><h1>A&Ntilde;OS DOSMIL</h1></header>
<body>
<center>
  <h2> 2000 - 2010 </h2>
  <img src="..\Practica1\imagenes\web-2.0.jpg" width="200" height="200">
    <b><h1>Web 2.0</h1></b>
    <p>Est&aacute; asociado a aplicaciones Web que facilitan el compartir informaci&oacute;n, la interoperabilidad, el diseño centrado en el usuario y la colaboraci&oacute;n en la World Wide Web.</p>
  <b><h1>Ejemplos de la Web 2.0</h1></b>
    <img src="..\Practica1\imagenes\Redes sociales.jpg" width="200" height="200">
    <p>Comunidades Web, los servicios Web, las aplicaciones Web, los servicios de red social, los servicios de alojamientos de videos, las wikis, blogs y mashups.</p>
  <h2>2004</h2>
    <img src="..\Practica1\imagenes\web-2.0-oreilly.jpg" width="200" height="200">
    <p>El t&eacute;rmino fue utilizado por primera vez por Darcy DiNucci en 1999 en uno de sus artículos, aunque no fue hasta 2004 cuando Tim O'Reilly lo hizo popular.</p>
  <h2> 2004 </h2>
    <b><h1>Facebook</h1></b>
    <img src="..\Practica1\imagenes\facebook.jpg" width="200" height="200">
    <p> Conglomerado estadounidense de redes sociales con sede en Menlo Park, California. Fue fundado por Mark Zuckerberg.</p>
  <h2>2005</h2>
    <img src="..\Practica1\imagenes\web-2.0-oreilly.jpg" width="200" height="200">
    <p>O’Reilly definiera la Web 2.0 como un nuevo paradigma.</p>
  <h2>2008</h2>
  <b><h1>Caracter&iacute;sticas de la Web 2.0</h1></b>
    <p>1. La web 2.0 es interactiva, el internet esta definido para los usuarios, quienes participan en el contenido creándolo.<br>
        2. La Web 2.0 est&aacute; orientado a la interacci&oacute;n y redes sociales, actúa más como puntos de encuentro.<br>
        3. Los usuarios se transforman en productores de contenidos.<br>
        4. Posibilidad de publicar informaciones y realizar cambios en los datos sin necesidad de muchos conocimientos tecnol&oacute;gicos.<br>
        5. Destinada a la navegaci&oacute;n (Personas conect&aacute;ndose a personas).</p>
  <h2>2010</h2>
    <b><h1>Web sem&aacute;ntica</h1></b>
    <img src="..\Practica1\imagenes\web-semantica.jpg" width="200" height="200">
    <p>La Web sem&aacute;ntica consiste en añadir metadatos a la WWW. El creador de la idea fue Tim Berners Lee.</p>
  <b><h1>Tendencias tecnolog&iacute;as</h1></b>
    <p>1. La transformaci&oacute;n de la Web en una base de datos distribuida.<br>
        2. La introducci&oacute;n de la tecnolog&iacute;a de Web sem&aacute;ntica.<br>
        3. Hacer los contenidos Web accesibles desde m&uacute;ltiples dispositivos.<br>
        4. El uso de las tecnolog&iacute;as de inteligencia artificial.<br>
        5. La Web geoespacial.<br>
        6. Uso de la tecnolog&iacute;a para 3D.</p>
  <h2>2013</h2>
    <p>Las tecnolog&iacute;as de la Web 3.0, como programas inteligentes, que utilizan datos sem&aacute;nticos, se han implementado y usado a pequeña escala en compañ&iacute;as para conseguir una manipulaci&oacute;n de datos m&aacute;s eficiente.</p>
  <b><h1>Web 4.0</h1></b>
    <img src="..\Practica1\imagenes\web-4.0.jpg" width="200" height="200">
    <p>Esta nueva versi&oacute;n de la Red se basar&aacute; en explotar toda la informaci&oacute;n que ahora mismo contiene, pero de una forma m&aacute;s natural y efectiva.</p>
  <b><h1>Pilares de la web 4.0</h1></b>
    <p>La comprensi&oacute;n del lenguaje natural y tecnolog&iacute;as Speech to text (de voz a texto y viceversa) Nuevos sistemas de comunicaci&oacute;n m&aacute;quina a m&aacute;quina (M2M). Uso de la informaci&oacute;n de contexto. Nuevo modelo de interacci&oacute;n con el usuario.</p>
  <b><h1>Deep learning</h1></b>
    <img src="..\Practica1\imagenes\Deep-Learning.jpeg" width="200" height="200">
    <p>Son pilares que sustentan la inteligencia artificial.</p>
  <b><h1>Machine learning</h1></b>
    <img src="..\Practica1\imagenes\machine-learning.jpg" width="200" height="200">
    <p>Estudio de algoritmos informáticos que mejoran automáticamente a través de la experiencia.</p>
  <b><h1>Artificial neuronal network</h1></b>
    <img src="..\Practica1\imagenes\artificial neuronal network.jpg" width="200" height="200">
    <p>Son sistemas inform&aacute;ticos inspirados vagamente en las redes neuronales biol&oacute;gicas que constituyen los cerebros de los animales.</p>
  <b><h1>Asistentes de voz</h1></b>
    <img src="..\Practica1\imagenes\google assistant.jpg" width="200" height="200">
    <img src="..\Practica1\imagenes\siri.jpg" width="200" height="200">
    <p>Siri, Google Now o Cortana cada vez entienden de forma m&aacute;s precisa y correcta lo que les decimos. Es m&aacute;s, ya hay smartphones que siempre est&aacute;n “escuchando” para activarse en el preciso momento que oigan "Oye, Siri" u "Hola, Google Now".</p>
  <b><h1>Bots</h1></b>
    <img src="..\Practica1\imagenes\bots.jpg" width="200" height="200">
    <p>Son un primer paso hacia esa interacci&oacute;n que promete la Web 4.0. Por ahora dependen de la introducción de texto, pero, con la evolución en tecnolog&iacute;as Speech to text, seremos capaces de conversar con ellos de igual modo que lo har&iacute;amos con un amigo en una cafeter&iacute;a.</p>
  <b><h1>Computaci&oacute;n cognitiva</h1></b>
    <p>A trav&eacute;s de potentes ordenadores se almacenar&aacute;n y procesar&aacute;n nuestros datos, peticiones y mucho m&aacute;s en la nube, permitiendo no s&oacute;lo que cualquier dispositivo con conexi&oacute;n a internet nos ayude a aprovecharnos de ellos sino tambi&eacute;n sirviendo cada uno de nosotros como educadores de esas m&aacute;quinas.</p>
  </center>
  <br>
  <DIV ALIGN="right">
    <a href="LineaTiempo.html"> <img src="https://turismo-en-mi-pais.webnode.mx/_files/200000043-06c4507be3/450/boton_regresar.png" alt="REGRESAR" width="10%"> </a>
    </DIV>

</body>
</html>
